{
    "events":
    [
        {
            "section": "Concerts",
            "locations":
                [
                {"id":"2013_04_25_metrotimes_blowout_kickoff","name":"Metrotimes Blowout Kickoff Party","masthead":"Metrotimes Blowout Kickoff Party","venue":"Magic Stick","location":"Detroit, MI","date":"Thursday 4/25/2013","opener":"","details":"A preview, of sorts, of the madness to come over the next two weekends of the Metrotimes Blowout. Hunker down for the official Kickoff Party at the Magic Stick/Garden Bowl, where 25 of the best local bands will shred, wail, dance and party until 2 AM. You <i>will</i> be calling in on Friday.","url":"http://www2.metrotimes.com/blowout/"},
                {"id":"2013_04_26_metrotimes_blowout","name":"Metrotimes Blowout","masthead":"Metrotimes Blowout","venue":"","location":"Hamtramck, MI","date":"Friday - Saturday 4/26/2013 - 4/27/2013","opener":"","details":"And so it begins. Blowout 16 takes over Hamtramck for two nights before staking new ground in Ferndale the following weekend. A few highlights: On Friday night, punk/hardcore fans will want to park themselves at the Polish National Alliance for the entirety of the night, while the Hard Lessons will hit up Small’s and Cold Men Young play the New Dodge. Saturday’s highlights include the psychedelic haze of Sister of Your Sunshine Vapor, the self-described “creep-pop” of The Oscillating Fan Club and the rock vibes of Blowout veterans, the Sights.","url":"http://www2.metrotimes.com/blowout/"},
                {"id":"2013_05_03_James_Blake","name":"James Blake","masthead":"","venue":"Majestic Theatre ","location":"Detroit, MI","date":"Friday  5/3/2013 8 PM","opener":"Falty DL","details":"English producer and singer-songwriter James Blake is known for his genre-bending sounds. Is it electronic? Indie? R&B? Who cares what you call it, just know that it’s good. So good in fact that his self-titled debut was nominated for a Mercury Prize in 2011, and his new release, <I>Overgrown</I> features the likes of Brian Eno and RZA. You will kick yourself later if you miss this one.","url":"http://www.ticketmaster.com/James-Blake-tickets/artist/1543667"},
                {"id":"2013_05_04_purity_ring","name":"Purity Ring","masthead":"","venue":"The Crofoot","location":"Pontiac, MI","date":"Saturday  5/4/2013 8:00 PM","opener":"Blue Hawaii","details":"Electronic duo from Edmonton hasn’t been around all that long but they’ve got a list of credentials that would make you think otherwise. Purity Ring makes dreamy electro-pop, with beats informed by their love of hip hop and R&B. Check out their cover of Soulja Boy’s “Grammy” if you haven’t yet. And then go check them out at The Crofoot.","url":"http://www.thecrofoot.com/events/2113.html"},
                {"id":"2013_05_02_metrotimes_blowout","name":"Metrotimes Blowout","masthead":"","venue":"","location":"Ferndale, MI","date":"Thursday 5/2/2013 - Saturday 5/4/2013","opener":"","details":"Weekend two of Blowout invades Ferndale for the first time ever. Our must-sees include Passalacqua, James Linck, Tunde Olaniran, and Phantasmagoria on Thursday; Jessica Hernandez and the Deltas and Bars of Gold on Friday; and Alexis and The Beggars on Saturday. But don’t just take our word—the best part of Blowout is discovering bands you otherwise might not see. Go forth and explore.","url":""},
                {"id":"2013_05_10_Charles_Bradley","name":"Charles Bradley","masthead":"","venue":"Magic Bag ","location":"Ferndale, MI","date":"Friday 5/10/2013 8 PM","opener":"","details":"In what can only be described as a very special treat for fans of 60’s and 70’s funk and soul, Charles Bradley and The Extraordinaires are headed to the Magic Bag. The 64-year-old former James Brown impersonator is known for his explosive performances and his songs tell of real-life heartache and hop in equal measure.","url":"http://www.ticketmaster.com/Charles-Bradley-and-His-Extraordinaires-tickets/artist/1663077"},
                {"id":"2013_05_10_motorcycle_club","name":"Black Rebel Motorcycle Club","masthead":"","venue":"Saint Andrew's Hall","location":"Detroit, MI","date":"Friday 5/10/2013 8 PM","opener":"Thenewno2","details":"It’s been a few years since BRMC has swung through town, but soon enough they’ll be here, in support of their sixth studio album, <I> Specter at the Feast</I>. They’re known for bluesy stomps, wailing guitars and sneering vocals of which you’d never want to be on the receiving end, and they pour everything they’ve got into their intense live shows.","url":"http://www.ticketmaster.com/Black-Rebel-Motorcycle-Club-tickets/artist/806799"},
                {"id":"2013_05_18_Rodriguiz","name":"Rodriguez","masthead":"","venue":"Masonic Temple","location":"Detroit, MI","date":"Saturday 5/18/2013  9 PM","opener":"Jenny O","details":"If you haven’t heard of Rodriguez by now, we’re not sure where you’ve been. The 70-year-old singer/songwriter was the subject of the riveting, Academy Award-winning documentary Searching for Sugarman, and after decades of obscurity, Rodriguez finally has a captive audience. His music may have been written four decades ago, but it transcends time with lyrics that could go toe-to-toe with anything Bob Dylan ever wrote and melodies that stick even after just one listen. His stop at the Masonic will be a performance you won’t forget.","url":"http://www.ticketmaster.com/Rodriguez-tickets/artist/1300544"},
                {"id":"2013_05_21_tenacious_d","name":"Tenacious D","masthead":"","venue":"The Howell Opera House ","location":"Howell, MI","date":"Tuesday 5/21/2013","opener":"With Sasquatch","details":"JB and Kage return to Detroit to prove to all that The D has <I>Rizen</I> like the <I>Fenix</I>. Whether they’re performing as an acoustic duo or backed up by a full, all-star band of studio and touring aces from the LA scene, Grammy nominees Jack Black and Kyle Gass never falter in their quest to rock you like the proverbial hurricane","url":""}                ]
        }
    ]
}